---
type: HomeCamera
namespace: Autodesk.Revit.DB
version: 2024
members: 14
tags: [revit-api, class]
---

# HomeCamera

`Autodesk.Revit.DB.HomeCamera` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | HomeCamera | 2016 | `public HomeCamera ( HomeCamera other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | BottomAngleOfFieldOfView | 2016 | `public double BottomAngleOfFieldOfView { get ; }` |
| Property | Center | 2016 | `public XYZ Center { get ; }` |
| Property | EyePosition | 2016 | `public XYZ EyePosition { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LeftAngleOfFieldOfView | 2016 | `public double LeftAngleOfFieldOfView { get ; }` |
| Property | OrthogonalProjectionHeight | 2016 | `public double OrthogonalProjectionHeight { get ; }` |
| Property | OrthogonalProjectionWidth | 2016 | `public double OrthogonalProjectionWidth { get ; }` |
| Property | Pivot | 2016 | `public XYZ Pivot { get ; }` |
| Property | RightAngleOfFieldOfView | 2016 | `public double RightAngleOfFieldOfView { get ; }` |
| Property | TopAngleOfFieldOfView | 2016 | `public double TopAngleOfFieldOfView { get ; }` |
| Property | UpDirection | 2016 | `public XYZ UpDirection { get ; }` |
| Property | ViewId | 2016 | `public ElementId ViewId { get ; }` |